In [2]:
import pandas as pd
from pandas import DataFrame

In [3]:
df = DataFrame

In [4]:
df = pd.read_csv(r"C:\Users\Sett's Wife\Desktop\Data Analysis\Certificates\IBM Data Analyst Professional Certificate edX\Course 9 Data Analytics and Visualization Capstone Project\Module 5 How to Present Your Findings\Data\New folder\Data Wrangling\panel 4\Webframe.csv")

In [5]:
df

       Unnamed: 0  Respondent WebframeDesireNextYear WebframeWorkedWith
0               0          10                  Flask              Flask
1               1          10                    NaN             jQuery
2               2          10                 jQuery                NaN
3               4          33                Express            Angular
4               5          33                    NaN         Angular.js
...           ...         ...                    ...                ...
22789       47562       64938                 Django             Django
22790       47563       64938                    NaN              Flask
22791       47564       64938                    NaN      Ruby on Rails
22792       47565       64938                    NaN             jQuery
22793       47566       64938                  Flask                NaN

[22794 rows x 4 columns]

In [6]:
df.shape

(22794, 4)

In [7]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
22789    False
22790    False
22791    False
22792    False
22793    False
Length: 22794, dtype: bool

In [8]:
df = df.drop_duplicates()

In [9]:
df

       Unnamed: 0  Respondent WebframeDesireNextYear WebframeWorkedWith
0               0          10                  Flask              Flask
1               1          10                    NaN             jQuery
2               2          10                 jQuery                NaN
3               4          33                Express            Angular
4               5          33                    NaN         Angular.js
...           ...         ...                    ...                ...
22789       47562       64938                 Django             Django
22790       47563       64938                    NaN              Flask
22791       47564       64938                    NaN      Ruby on Rails
22792       47565       64938                    NaN             jQuery
22793       47566       64938                  Flask                NaN

[22794 rows x 4 columns]

In [11]:
import numpy as np

In [12]:
df.replace(np.nan, inplace = True)

Unnamed: 0                None
Respondent                None
WebframeDesireNextYear    None
WebframeWorkedWith        None
dtype: object

In [13]:
df

       Unnamed: 0  Respondent WebframeDesireNextYear WebframeWorkedWith
0               0          10                  Flask              Flask
1               1          10                  Flask             jQuery
2               2          10                 jQuery             jQuery
3               4          33                Express            Angular
4               5          33                Express         Angular.js
...           ...         ...                    ...                ...
22789       47562       64938                 Django             Django
22790       47563       64938                 Django              Flask
22791       47564       64938                 Django      Ruby on Rails
22792       47565       64938                 Django             jQuery
22793       47566       64938                  Flask             jQuery

[22794 rows x 4 columns]

In [14]:
missing_data = df.isnull()

In [15]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

Unnamed: 0
False    22794
Name: Unnamed: 0, dtype: int64

Respondent
False    22794
Name: Respondent, dtype: int64

WebframeDesireNextYear
False    22794
Name: WebframeDesireNextYear, dtype: int64

WebframeWorkedWith
False    22794
Name: WebframeWorkedWith, dtype: int64

In [16]:
df.duplicated().sum()

0

In [17]:
df.isnull().sum()

Unnamed: 0                0
Respondent                0
WebframeDesireNextYear    0
WebframeWorkedWith        0
dtype: int64

In [18]:
df.dtypes

Unnamed: 0                 int64
Respondent                 int64
WebframeDesireNextYear    object
WebframeWorkedWith        object
dtype: object

In [ ]:
df.to_csv(r"C:\Users\Sett's Wife\Desktop\Data Analysis\Certificates\IBM Data Analyst Professional Certificate edX\Course 9 Data Analytics and Visualization Capstone Project\Module 5 How to Present Your Findings\Data\New folder\Data Wrangling\panel 4\Webfr.csv")